#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьУведомленияТелеграмБоту() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Текст КАК Текст,
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		//для теста очистки справочника без Телеграм
		//Ответ = Новый HTTPСервисОтвет(200);
		//
		Ответ = ТелеграмБот(ВыборкаДетальныеЗаписи.Текст);
		Если Ответ.КодСостояния = 200 Тогда
			ЭлементСправочника = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ЭлементСправочника.Удалить();
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ТелеграмБот(ТекстСообщения)

	Токен = Константы.ВКМ_ТокенТелеграмБот.Получить();
	ЧатИД = Константы.ВКМ_ИдентификаторГруппыТелеграм.Получить();

	АдресСоединения = "api.telegram.org";
	ШаблонЗапроса = "/bot%1/%2";

	Соединение = Новый HTTPСоединение(АдресСоединения, , , , , , Новый ЗащищенноеСоединениеOpenSSL);

	СтруктураСообщения = Новый Структура("chat_id, text");
	СтруктураСообщения.chat_id = ЧатИД;
	СтруктураСообщения.text = ТекстСообщения;
	JSONСообщения = ЗаписатьЗначениеJSON(СтруктураСообщения);

	АдресОтправки = СтрШаблон(ШаблонЗапроса, Токен, "sendMessage");
	ЗапросОтправки = Новый HTTPЗапрос(АдресОтправки);
	ЗапросОтправки.УстановитьТелоИзСтроки(JSONСообщения);
	ЗапросОтправки.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");

	Попытка
		Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросОтправки);
	Исключение
		ЗаписьЖурналаРегистрации("ТелеграмБот", УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Ответ = Новый HTTPСервисОтвет(500);
	КонецПопытки;

	Возврат Ответ;
КонецФункции

#КонецОбласти

#КонецЕсли