#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачислениеПриИзменении(Элемент)
	
	ИзменитьПериодДействия();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ИзменитьПериодДействия();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьПериодДействия()

		Объект.ДатаНачалаПериодаДействия = НачалоМесяца(Объект.Дата);
		Объект.ДатаОкончанияПериодаДействия = КонецМесяца(Объект.Дата);

КонецПроцедуры

#КонецОбласти