#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Ответственный = Пользователи.ТекущийПользователь();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ЗаказПокупателя.Организация КАК Организация,
				   |	ЗаказПокупателя.Контрагент КАК Контрагент,
				   |	ЗаказПокупателя.Договор КАК Договор,
				   |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
				   |	ЗаказПокупателя.Товары.(
				   |		Ссылка КАК Ссылка,
				   |		НомерСтроки КАК НомерСтроки,
				   |		Номенклатура КАК Номенклатура,
				   |		Количество КАК Количество,
				   |		Цена КАК Цена,
				   |		Сумма КАК Сумма
				   |	) КАК Товары,
				   |	ЗаказПокупателя.Услуги.(
				   |		Ссылка КАК Ссылка,
				   |		НомерСтроки КАК НомерСтроки,
				   |		Номенклатура КАК Номенклатура,
				   |		Количество КАК Количество,
				   |		Цена КАК Цена,
				   |		Сумма КАК Сумма
				   |	) КАК Услуги
				   |ИЗ
				   |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
				   |ГДЕ
				   |	ЗаказПокупателя.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);

	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;

	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;

	Основание = ДанныеЗаполнения;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;

	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	//++ Двоенко Диплом_ВКМ
	Если Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда	
		Движения.Продажи.Очистить();
		Движения.Продажи.Записать();
		Движения.Продажи.Записывать = Истина;
	
		Для Каждого ТекСтрокаУслуги Из Услуги Цикл
			Движение = Движения.Продажи.Добавить();
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Номенклатура = ТекСтрокаУслуги.Номенклатура;
			Движение.Сумма = ТекСтрокаУслуги.Сумма;
		КонецЦикла;
	КонецЕсли;
	//-- Двоенко Диплом_ВКМ

КонецПроцедуры

Процедура ВыполнитьАвтозаполнение() Экспорт
	//++ Двоенко Диплом_ВКМ
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	Если Не ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не введена константа Номенклатура Абонентская Плата. Для заполнения документа необходимо указать.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	Если Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не введена константа Номенклатура Работы Специалиста. Для заполнения документа необходимо указать.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	Товары.Очистить();
	Услуги.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0) КАК Количество,
	|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0) КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОКР(ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0) /
	|			ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0), 2)
	|	КОНЕЦ КАК Цена,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ВКМ_ДатаНачалаДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ВКМ_ДатаОкончанияДействияДоговора,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора >= &НачалоПериода
	|		И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора <= &КонецПериода
	|			ТОГДА РАЗНОСТЬДАТ(ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора,
	|				ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора, ДЕНЬ) + 1
	|		КОГДА ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора >= &НачалоПериода
	|		И ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора < &КонецПериода
	|		И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора > &КонецПериода
	|			ТОГДА РАЗНОСТЬДАТ(ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора, &КонецПериода, ДЕНЬ)+1
	|		КОГДА ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора < &НачалоПериода
	|		И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора > &НачалоПериода
	|		И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора < &КонецПериода
	|			ТОГДА РАЗНОСТЬДАТ(&НачалоПериода, ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора, ДЕНЬ) + 1
	|		КОГДА ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора < &НачалоПериода
	|		И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора > &КонецПериода
	|			ТОГДА РАЗНОСТЬДАТ(&НачалоПериода, &КонецПериода, ДЕНЬ)+1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДействующихДнейВМесяце
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода,,
	|			Договор = &Ссылка) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
	|		ПО ДоговорыКонтрагентов.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка", Договор);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если ВыборкаДетальныеЗаписи.СуммаАбонентскойПлаты <> 0 Тогда

			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.ДействующихДнейВМесяце; // Допущение: При действии договора не полный месяц абонплата рассчитывается пропорционально дней действия договора в месяце.
			НоваяСтрока.Цена = Окр(ВыборкаДетальныеЗаписи.СуммаАбонентскойПлаты / Число(День(КонецМесяца(Дата))), 2,
				РежимОкругления.Окр15как20);
			Если ВыборкаДетальныеЗаписи.ДействующихДнейВМесяце = Число(День(КонецМесяца(Дата))) Тогда
				НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаАбонентскойПлаты;
			Иначе
				НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
			КонецЕсли;

		КонецЕсли;

		Если ВыборкаДетальныеЗаписи.Количество <> 0 Тогда

			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
			НоваяСтрока.Количество = ВыборкаДетальныеЗаписи.Количество;
			НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.Цена;
			НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.Сумма;

		КонецЕсли;

	КонецЦикла;

	Основание = Договор; // Допущение: Основание заполняется Договором, т.к. Основание - обязательный для заполнения реквизит.

	Записать();
	//-- Двоенко Диплом_ВКМ	
КонецПроцедуры

#КонецОбласти

#КонецЕсли