#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Объект.Год = Параметры.Год;
	Объект.Дата = Параметры.Дата;
	Объект.Номер = Параметры.Номер;
	Объект.Сценарий = Параметры.Сценарий;
	
	АвтоЗаголовок = Ложь;
	Заголовок = "Анализ графика (" + Параметры.ЗаголовокФормы + ")";
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыДанных);
	СформироватьДиаграммуГанта(ТаблицаДанных);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьДиаграммуГанта(ТаблицаДанных)

	АнализГрафика.Обновление = Ложь;
	АнализГрафика.Очистить();
	
	АнализГрафика.АвтоОпределениеПолногоИнтервала = Ложь;
	АнализГрафика.УстановитьПолныйИнтервал(Дата(Объект.Год, 1, 1), Дата(Объект.Год, 12, 31));
	
	Для Каждого Строка Из ТаблицаДанных Цикл

		ТочкаСотрудник = АнализГрафика.УстановитьТочку(Строка.Сотрудник);
		ТочкаСотрудник.Текст = Строка.Сотрудник;

		СерияОтпуск = АнализГрафика.УстановитьСерию("Отпуск");
		СерияОтпуск.Текст = "Отпуск";

		Значение = АнализГрафика.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);

		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = КонецДня(Строка.ДатаОкончания);

	КонецЦикла;
	
	АнализГрафика.Обновление = Истина;

КонецПроцедуры
#КонецОбласти