#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачислениеПриИзменении(Элемент)
	
	ИзменитьПериодДействия();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ИзменитьПериодДействия();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьПериодДействия()

	Если Объект.Начисление = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
		Элементы.ДатаНачалаПериодаДействия.Доступность = Истина;
		Элементы.ДатаОкончанияПериодаДействия.Доступность = Истина;
	Иначе
		Объект.ДатаНачалаПериодаДействия = НачалоМесяца(Объект.Дата);
		Объект.ДатаОкончанияПериодаДействия = КонецМесяца(Объект.Дата);
		Элементы.ДатаНачалаПериодаДействия.Доступность = Ложь;
		Элементы.ДатаОкончанияПериодаДействия.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти