#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
		
	// регистр ВКМ_ОсновныеНачисления
	Движения.ВКМ_ОсновныеНачисления.Очистить();
	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;

	ВыборкаДетальныеЗаписи = ПолучитьДанныеДокумента();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Начисление = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад
			И ВыборкаДетальныеЗаписи.ОкладНеУстановлен Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Для сотрудника: %1 не установлен оклад на дату: %2",
				ВыборкаДетальныеЗаписи.Сотрудник, ДатаНачалаПериодаДействия);
			Сообщение.Сообщить();
			Отказ = Истина;
			Прервать;
		ИначеЕсли ВыборкаДетальныеЗаписи.Начисление = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентОтРабот
			И ВыборкаДетальныеЗаписи.ПроцентНеУстановлен Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Для сотрудника: %1 не установлен процент от работ на дату: %2",
				ВыборкаДетальныеЗаписи.Сотрудник, ДатаНачалаПериодаДействия);
			Сообщение.Сообщить();
			Отказ = Истина;
			Прервать;
		ИначеЕсли ВыборкаДетальныеЗаписи.Начисление = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентОтРабот
			И ВыборкаДетальныеЗаписи.НетВыполненныхРабот Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("По сотруднику: %1 нет данных о выполненных работах за период: %2 - %3",
				ВыборкаДетальныеЗаписи.Сотрудник, ДатаНачалаПериодаДействия, КонецДня(ДатаОкончанияПериодаДействия));
			Сообщение.Сообщить();
			Отказ = Истина;
			Прервать;
		Иначе
			//основные начисления
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ВыборкаДетальныеЗаписи.Начисление;
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = ДатаНачалаПериодаДействия;
			Движение.ПериодДействияКонец = КонецДня(ДатаОкончанияПериодаДействия);
			Если Начисление = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
				Движение.БазовыйПериодНачало = ДобавитьМесяц(НачалоМесяца(ДатаНачалаПериодаДействия), -12);
				Движение.БазовыйПериодКонец = НачалоМесяца(ДатаНачалаПериодаДействия) - 1;
			Иначе
				Движение.БазовыйПериодНачало = ДатаНачалаПериодаДействия;
				Движение.БазовыйПериодКонец = КонецДня(ДатаОкончанияПериодаДействия);
			КонецЕсли;
			Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				Движение.Показатель = ВыборкаДетальныеЗаписи.Оклад;
			КонецЕсли;
			Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентОтРабот Тогда
				Движение.Сумма = ВыборкаДетальныеЗаписи.ПроцентОтРабот;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать();
		
	//сумма оклад и отпуск
	РезультатЗапроса = РассчитатьОкладИОтпуск();
	Если РезультатЗапроса.Выгрузить().Количество() > 0 Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Запись = Движения.ВКМ_ОсновныеНачисления.Получить(ВыборкаДетальныеЗаписи.НомерСтроки - 1);
			Если Запись.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				Запись.Сумма = ВыборкаДетальныеЗаписи.СуммаОклад;
			ИначеЕсли Запись.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
				Запись.Сумма = ВыборкаДетальныеЗаписи.СуммаОтпуск;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Движения.ВКМ_ОсновныеНачисления.Записать( , Истина);
		
	// регистр ВКМ_Удержания
	Движения.ВКМ_Удержания.Очистить();
	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_Удержания.Записывать = Истина;

	Для Каждого Запись Из Движения.ВКМ_ОсновныеНачисления Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = ДатаНачалаПериодаДействия;
		Движение.ПериодДействияКонец = КонецДня(ДатаОкончанияПериодаДействия);
		Движение.БазовыйПериодНачало = ДатаНачалаПериодаДействия;
		Движение.БазовыйПериодКонец = КонецДня(ДатаОкончанияПериодаДействия);
		Движение.Сотрудник = Запись.Сотрудник;
		Движение.Сумма = окр(Запись.Сумма * Константы.ВКМ_НДФЛ.Получить() / 100, 2, РежимОкругления.Окр15как20);
	КонецЦикла;

	Движения.ВКМ_Удержания.Записать();
		
	// регистр ВКМ_ВзаиморасчетыССотрудниками
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.Сумма, 0) - ЕСТЬNULL(ВКМ_УдержанияДанныеГрафика.Сумма, 0)) КАК Сумма
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.ДанныеГрафика(Регистратор = &Ссылка) КАК ВКМ_УдержанияДанныеГрафика
	|		ПО ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник = ВКМ_УдержанияДанныеГрафика.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = КонецДня(Дата);
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;
		
		//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
		//Данный фрагмент построен конструктором.
		//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
		
		//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДокумента()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_НачисленияЗарплаты.Начисление КАК Начисление,
	|	ВКМ_НачисленияЗарплатыСотрудники.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.Сотрудники КАК ВКМ_НачисленияЗарплатыСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_НачисленияЗарплаты КАК ВКМ_НачисленияЗарплаты
	|		ПО ВКМ_НачисленияЗарплатыСотрудники.Ссылка = ВКМ_НачисленияЗарплаты.Ссылка
	|ГДЕ
	|	ВКМ_НачисленияЗарплаты.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_НачисленияЗарплаты.Начисление,
	|	ВКМ_НачисленияЗарплатыСотрудники.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеДокумента.Начисление КАК Начисление,
	|	СУММА(ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 0)) КАК Оклад,
	|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот, 0)) КАК ПроцентОтРабот,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 1) = 1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОкладНеУстановлен,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 1) = 1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентНеУстановлен,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот, 1) = 1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НетВыполненныхРабот
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода,,
	|			Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|		ПО ВТ_ДанныеДокумента.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&НачалоПериода, Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_ДанныеДокумента.Сотрудник = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеДокумента.Начисление,
	|	ВТ_ДанныеДокумента.Сотрудник,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, 1) = 1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 1) = 1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот, 1) = 1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачалаПериодаДействия);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаОкончанияПериодаДействия));

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выбрать();

КонецФункции

Функция РассчитатьОкладИОтпуск()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.Показатель) КАК Показатель,
	|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньПериодДействия, 0)) КАК РабочихДнейПлан,
	|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия, 0)) КАК РабочихДнейФакт,
	|	СУММА(ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньПериодДействия, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОКР(ВКМ_ОсновныеНачисленияДанныеГрафика.Показатель /
	|			ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньПериодДействия, 0) *
	|			ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия, 0), 2)
	|	КОНЕЦ) КАК СуммаОклад
	|ПОМЕСТИТЬ ВТ_Оклад
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(ВидРасчета = &ВидРасчетаОклад
	|	И Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
	|	КОНЕЦ КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.Сотрудник
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник
	|	КОНЕЦ КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ВидРасчета, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ВидРасчета
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ВидРасчета
	|	КОНЕЦ КАК ВидРасчета,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияНачало, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ПериодДействияНачало
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияНачало
	|	КОНЕЦ КАК ПериодДействияНачало,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияКонец, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ПериодДействияКонец
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияКонец
	|	КОНЕЦ КАК ПериодДействияКонец,
	|	МАКСИМУМ(РАЗНОСТЬДАТ(ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияНачало, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ПериодДействияНачало
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияНачало
	|	КОНЕЦ, ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияКонец, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ПериодДействияКонец
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияКонец
	|	КОНЕЦ, ДЕНЬ) + 1) КАК ДлительностьОтпуска,
	|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.СуммаБаза, 0)) КАК СуммаБазаОсн,
	|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.СуммаБаза, 0)) КАК СуммаБазаДоп,
	|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.СуммаБаза, 0) +
	|		ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.СуммаБаза, 0)) КАК СуммаБазаОтпуск,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодНачало, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.БазовыйПериодНачало
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодНачало
	|	КОНЕЦ КАК ПериодБазаНачало,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодКонец, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.БазовыйПериодКонец
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодКонец
	|	КОНЕЦ КАК ПериодБазаКонец
	|ПОМЕСТИТЬ ВТ_ОтпускБазаСумма
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,, Регистратор = &Ссылка
	|	И ВидРасчета = &ВидРасчетаОтпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения,,
	|			Регистратор = &Ссылка
	|		И ВидРасчета = &ВидРасчетаОтпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
	|		ПО ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник
	|		И
	|			ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ВидРасчета = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ВидРасчета
	|		И
	|			ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ПериодДействияНачало = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияНачало
	|		И
	|			ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ПериодДействияКонец = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияКонец
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.Сотрудник
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.Сотрудник
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ВидРасчета, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ВидРасчета
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ВидРасчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияНачало, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ПериодДействияНачало
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияНачало
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияКонец, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.ПериодДействияКонец
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ПериодДействияКонец
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодНачало, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.БазовыйПериодНачало
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодНачало
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодКонец, 0) = 0
	|			ТОГДА ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.БазовыйПериодКонец
	|		ИНАЧЕ ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.БазовыйПериодКонец
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОтпускБазаСумма.НомерСтроки КАК НомерСтроки,
	|	ВТ_ОтпускБазаСумма.Сотрудник КАК Сотрудник,
	|	ВТ_ОтпускБазаСумма.ВидРасчета КАК ВидРасчета,
	|	ВТ_ОтпускБазаСумма.СуммаБазаОтпуск КАК СуммаБазаОтпуск,
	|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия, 0)) КАК
	|		РабочихДнейБазаОтпуск,
	|	ВТ_ОтпускБазаСумма.ДлительностьОтпуска КАК ДлительностьОтпуска,
	|	ВЫБОР
	|		КОГДА СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия, 0)) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ОКР(ВТ_ОтпускБазаСумма.СуммаБазаОтпуск /
	|			СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия, 0)) *
	|			ВТ_ОтпускБазаСумма.ДлительностьОтпуска, 2)
	|	КОНЕЦ КАК СуммаОтпуск
	|ПОМЕСТИТЬ ВТ_ОтпускИтог
	|ИЗ
	|	ВТ_ОтпускБазаСумма КАК ВТ_ОтпускБазаСумма
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_ОтпускБазаСумма.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_ОтпускБазаСумма КАК ВТ_ОтпускБазаСумма)
	|		И ВидРасчета = &ВидРасчетаОклад) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|		ПО ВТ_ОтпускБазаСумма.Сотрудник = ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник
	|		И ВТ_ОтпускБазаСумма.ПериодБазаНачало <= ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодДействияНачало
	|		И ВТ_ОтпускБазаСумма.ПериодБазаКонец >= ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодДействияКонец
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОтпускБазаСумма.НомерСтроки,
	|	ВТ_ОтпускБазаСумма.Сотрудник,
	|	ВТ_ОтпускБазаСумма.ВидРасчета,
	|	ВТ_ОтпускБазаСумма.СуммаБазаОтпуск,
	|	ВТ_ОтпускБазаСумма.ДлительностьОтпуска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Оклад.НомерСтроки КАК НомерСтроки,
	|	ВТ_Оклад.ВидРасчета КАК ВидРасчета,
	|	ВТ_Оклад.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ_Оклад.РабочихДнейПлан) КАК РабочихДнейПлан,
	|	СУММА(ВТ_Оклад.РабочихДнейФакт) КАК РабочихДнейФакт,
	|	СУММА(ВТ_Оклад.СуммаОклад) КАК СуммаОклад,
	|	СУММА(ВТ_Оклад.Показатель) КАК Показатель,
	|	NULL КАК СуммаБазаОтпуск,
	|	NULL КАК РабочихДнейБазаОтпуск,
	|	NULL КАК ДлительностьОтпуска,
	|	NULL КАК СуммаОтпуск
	|ИЗ
	|	ВТ_Оклад КАК ВТ_Оклад
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Оклад.НомерСтроки,
	|	ВТ_Оклад.ВидРасчета,
	|	ВТ_Оклад.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_Отпуск_итог.НомерСтроки,
	|	ВТ_Отпуск_итог.ВидРасчета,
	|	ВТ_Отпуск_итог.Сотрудник,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	МАКСИМУМ(ВТ_Отпуск_итог.СуммаБазаОтпуск),
	|	СУММА(ВТ_Отпуск_итог.РабочихДнейБазаОтпуск),
	|	МАКСИМУМ(ВТ_Отпуск_итог.ДлительностьОтпуска),
	|	СУММА(ВТ_Отпуск_итог.СуммаОтпуск)
	|ИЗ
	|	ВТ_ОтпускИтог КАК ВТ_Отпуск_итог
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Отпуск_итог.НомерСтроки,
	|	ВТ_Отпуск_итог.ВидРасчета,
	|	ВТ_Отпуск_итог.Сотрудник,
	|	ВТ_Отпуск_итог.СуммаБазаОтпуск,
	|	ВТ_Отпуск_итог.ДлительностьОтпуска";

	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчетаОтпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);

	Возврат Запрос.Выполнить();

КонецФункции

#КонецОбласти

#КонецЕсли