#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++ Двоенко Диплом_ВКМ
	ГруппаАбонентскийДоговор = Элементы.Добавить("ГруппаАбонентскийДоговор", Тип("ГруппаФормы"), );
	ГруппаАбонентскийДоговор.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАбонентскийДоговор.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаАбонентскийДоговор.ОтображатьЗаголовок = Ложь;
	ГруппаАбонентскийДоговор.Видимость = Ложь;

	ГруппаПериодДействияДоговора = Элементы.Добавить("ГруппаПериодДействияДоговора", Тип("ГруппаФормы"),
		Элементы.ГруппаАбонентскийДоговор);
	ГруппаПериодДействияДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериодДействияДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ГруппаПериодДействияДоговора.Заголовок = "Период действия договора";

	ВКМ_ДатаНачалаДействияДоговора = Элементы.Вставить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"),
		Элементы.ГруппаПериодДействияДоговора, );
	ВКМ_ДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	ВКМ_ДатаНачалаДействияДоговора.Заголовок = "Дата начала";

	ВКМ_ДатаОкончанияДействияДоговора = Элементы.Вставить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"),
		Элементы.ГруппаПериодДействияДоговора, );
	ВКМ_ДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	ВКМ_ДатаОкончанияДействияДоговора.Заголовок = "Дата окончания";

	ВКМ_СуммаАбонентскойПлаты = Элементы.Вставить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"),
		Элементы.ГруппаАбонентскийДоговор, );
	ВКМ_СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ВКМ_СуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";

	ВКМ_СтоимостьЧасаРаботыСпециалиста = Элементы.Вставить("ВКМ_СтоимостьЧасаРаботыСпециалиста", Тип("ПолеФормы"),
		Элементы.ГруппаАбонентскийДоговор, );
	ВКМ_СтоимостьЧасаРаботыСпециалиста.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СтоимостьЧасаРаботыСпециалиста.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
	ВКМ_СтоимостьЧасаРаботыСпециалиста.Заголовок = "Стоимость часа работы специалиста";

	ПроверитьВидДоговора();
	//-- Двоенко Диплом_ВКМ
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//++ Двоенко Диплом_ВКМ
	ПроверитьВидДоговора();
	//-- Двоенко Диплом_ВКМ
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьВидДоговора()
	//++ Двоенко Диплом_ВКМ
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ГруппаАбонентскийДоговор.Видимость = Истина;
	Иначе
		Элементы.ГруппаАбонентскийДоговор.Видимость = Ложь;
	КонецЕсли;
	//-- Двоенко Диплом_ВКМ
КонецПроцедуры

#КонецОбласти