#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьДанныеЗаПериод(Команда)

	ЗаполнитьДанныеЗаПериодНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыЗаПериод(Команда)

	АдресСписка = СформироватьСписок();

	Если АдресСписка <> "" Тогда
		ДлительныеОперации = СоздатьДокументыЗаПериодНаСервере(АдресСписка);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительныеОперации, ОповещениеОЗавершении, ПараметрыОжидания);	
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "По всем договорам за период уже созданы документы";
		Сообщение.Сообщить();
	КонецЕсли;

	ЗаполнитьДанныеЗаПериодНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеЗаПериодНаСервере()

	Объект.СписокДоговоров.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	0 КАК Цифра
	|ПОМЕСТИТЬ Цифры
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	2
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	3
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	4
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	5
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	6
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	7
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	8
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	9
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Тысячи.Цифра * 1000 + Сотни.Цифра * 100 + Десятки.Цифра * 10 + Единицы.Цифра КАК Число
	|ПОМЕСТИТЬ Числа
	|ИЗ
	|	Цифры КАК Тысячи,
	|	Цифры КАК Сотни,
	|	Цифры КАК Десятки,
	|	Цифры КАК Единицы
	|ГДЕ
	|	Тысячи.Цифра * 1000 + Сотни.Цифра * 100 + Десятки.Цифра * 10 + Единицы.Цифра <= РАЗНОСТЬДАТ(&НачалоПериода,
	|		&КонецПериода, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ), МЕСЯЦ, Числа.Число) КАК Период
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	Числа КАК Числа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.Владелец КАК Владелец
	|ПОМЕСТИТЬ ВТ_ДоговорыДействующие
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора <= &КонецПериода
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &НачалоПериода
	|	И ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты <> 0
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК РеализацияТоваровУслуг,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, Месяц) КАК ПериодРеализации,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_РеализацииТоваровУслуг
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата >= &НачалоПериода
	|	И РеализацияТоваровУслуг.Дата <= &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Период КАК ПериодВыполненияРабот,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент КАК Клиент
	|ПОМЕСТИТЬ ВТ_ВыполненныеРаботы
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода, Месяц,
	|		Договор.ВидДоговора = &ВидДоговора) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Периоды.Период КАК Период,
	|	ВТ_ДоговорыДействующие.Договор КАК Договор,
	|	ВТ_РеализацииТоваровУслуг.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг,
	|	ВТ_ВыполненныеРаботы.ПериодВыполненияРабот КАК ПериодВыполненияРабот,
	|	ВТ_РеализацииТоваровУслуг.ПериодРеализации КАК ПериодРеализации
	|ИЗ
	|	ВТ_Периоды КАК ВТ_Периоды
	|		ПРАВОЕ СОЕДИНЕНИЕ ВТ_ДоговорыДействующие КАК ВТ_ДоговорыДействующие
	|		ПО ВТ_Периоды.Период >= НАЧАЛОПЕРИОДА(ВТ_ДоговорыДействующие.Договор.ВКМ_ДатаНачалаДействияДоговора, Месяц)
	|		И ВТ_Периоды.Период <= ВТ_ДоговорыДействующие.Договор.ВКМ_ДатаОкончанияДействияДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыполненныеРаботы КАК ВТ_ВыполненныеРаботы
	|		ПО ВТ_Периоды.Период = ВТ_ВыполненныеРаботы.ПериодВыполненияРабот
	|		И ВТ_ДоговорыДействующие.Договор = ВТ_ВыполненныеРаботы.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеализацииТоваровУслуг КАК ВТ_РеализацииТоваровУслуг
	|		ПО ВТ_Периоды.Период = ВТ_РеализацииТоваровУслуг.ПериодРеализации
	|		И ВТ_ДоговорыДействующие.Договор = ВТ_РеализацииТоваровУслуг.Договор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";

	Запрос.УстановитьПараметр("НачалоПериода", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Объект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		НоваяСтрока = Объект.СписокДоговоров.Добавить();
		НоваяСтрока.Период = ВыборкаДетальныеЗаписи.Период;
		НоваяСтрока.Договор = ВыборкаДетальныеЗаписи.Договор;
		НоваяСтрока.РеализацияТоваровУслуг = ВыборкаДетальныеЗаписи.РеализацияТоваровУслуг;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция СформироватьСписок()

	АдресСписка = "";
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("РеализацияТоваровУслуг", Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	СписокДоговоровБезРеализаций = Объект.СписокДоговоров.Выгрузить(ПараметрыОтбора, "Период, Договор");

	Если ЗначениеЗаполнено(СписокДоговоровБезРеализаций) Тогда
		АдресСписка = ПоместитьВоВременноеХранилище(СписокДоговоровБезРеализаций);
	КонецЕсли;
	
	Возврат АдресСписка;

КонецФункции

&НаСервере
Функция СоздатьДокументыЗаПериодНаСервере(АдресСписка)
	
	СписокДоговоров = ПолучитьИзВременногоХранилища(АдресСписка);
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
		"Документы.РеализацияТоваровУслуг.СоздатьРеализациюТоваровИУслуг", СписокДоговоров);
	Возврат ДлительнаяОперация;

КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт

	Если Результат.Статус = "Выполнено" Тогда
		СообщенияРезультат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Для Каждого Строка Из СообщенияРезультат Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Строка);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти